/*
SQL-програма - це послідовність SQL-команд

SQL-команда - це послідовність ключових слів та ідентифікаторів. Закінчується обов'язково ";"

Компонентами команди можуть бути:
- ключові слова 
- ідентифікатор

-- lowercase (маленькими літерами)
-- snake_case (_ замість пробілу)
-- без пробілів
-- не використовуємо в якості ідентифікаторів ключові слова

- ідентифікатор у лапках (кавычки)
- Для таблиць і атрибутів - ""
(для символьного типу даних будуть одинарні)


Спеціальні знаки
$ - або для ідентифікатора (хоча не бажано)
() - для групування виразів або визначення пріоритетності. Іноді є частиною синтаксису
[] - масиви
, - для розділювання елементів. Висяча кома не підтримується!!!
; - закінчує команду. Не може зустрічатись всередині виразу
* - залежно від контексту використання може означати "все" (для команди SELECT), м.б аргументом агрегатної функції та ін.
. - в числових константах, для визначення схеми (для доступу до таблиці всередині схеми)

*/



